app/views/api/v1/users/_info.json.jbuilder

json.last_name          user.last_name
json.friendships        user.friendships.each do |friendship|
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" IN ($1, $2, $3, $4, $5)  [["user_id", 1], ["user_id", 2], ["user_id", 3], ["user_id", 4], ["user_id", 5]]