app/controllers/api/v1/payments_controller.rb

UPDATE "accounts" SET "balance" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["balance", "89440.0"], ["updated_at", "2022-01-21 20:25:18.053305"], ["id", 1]]
---
      def send_money(amount)
        current_user_account = current_user.account
        friend_account = friend.account
        current_user_account.update!(balance: (current_user_account.balance - amount))
        friend_account.update!(balance: (friend_account.balance + amount))