app/controllers/api/v1/payments_controller.rb

INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 686], ["friend_id", 687], ["created_at", "2022-01-21 19:19:14.173566"], ["updated_at", "2022-01-21 19:19:14.173566"]]
INSERT INTO "payments" ("user_id", "friend_id", "description", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 25], ["friend_id", 24], ["description", "test msg"], ["amount", "643.14"], ["created_at", "2022-01-21 18:43:40.078051"], ["updated_at", "2022-01-21 18:43:40.078051"]]
INSERT INTO "users" ("first_name", "last_name", "username", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "Rayna"], ["last_name", "Barton"], ["username", "Homenick"], ["created_at", "2022-01-21 19:19:14.169661"], ["updated_at", "2022-01-21 19:19:14.169661"]]
---
      def create
        return render_unapproved_contractor unless current_user.friendships?(friend)

        @payment = current_user.payments.create!(payment_params)