app/controllers/api/v1/payments_controller.rb

INSERT INTO "payments" ("user_id", "friend_id", "description", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["friend_id", 5], ["description", "aca no paso nada"], ["amount", "880.0"], ["created_at", "2022-01-21 20:25:18.029914"], ["updated_at", "2022-01-21 20:25:18.029914"]]
---
      def create
        return render_unapproved_contractor unless current_user.friendships?(friend)

        @payment = current_user.payments.create!(payment_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def current_user
        @current_user = User.find(params[:id] || params[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
      def friend
        @friend = User.find(payment_params[:friend_id])

INSERT INTO "feeds" ("user_id", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["description", "Bruno Parma send 880.0 to Tim Cook at 2022-01-21 20:43:56 UTC"], ["created_at", "2022-01-21 20:43:56.708566"], ["updated_at", "2022-01-21 20:43:56.708566"]]
INSERT INTO "feeds" ("user_id", "friend_id", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
      def create_feed
        feed = FeedService.new(@current_user, @friend, @payment).create_feed
        current_user.feeds.create!(description: feed, friend_id: @friend.id)

UPDATE "accounts" SET "balance" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["balance", "-3546.0"], ["updated_at", "2022-01-21 22:01:07.044413"], ["id", 5]]
UPDATE "accounts" SET "balance" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["balance", "103556.0"], ["updated_at", "2022-01-21 22:01:07.048918"], ["id", 1]]
---
      def update_accounts(amount)
        current_user_account = current_user.account
        friend_account = friend.account
        current_user_account.update!(balance: (current_user_account.balance - amount))
        friend_account.update!(balance: (friend_account.balance + amount))