app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 1], ["OFFSET", 1]]
---
      def index
        @users = User.all

SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 2], ["id", 1]]
SELECT COUNT(*) FROM (SELECT DISTINCT "feeds".* FROM "feeds" WHERE ("feeds"."user_id" IN ($1, $2, $3, $4, $5) OR "payments"."friend_id" IN ($6, $7, $8, $9, $10)) ORDER BY "feeds"."created_at" DESC) subquery_for_count  [["user_id", 1], ["user_id", 2], ["user_id", 3], ["user_id", 4], ["user_id", 5], ["friend_id", 1], ["friend_id", 2], ["friend_id", 3], ["friend_id", 4], ["friend_id", 5]]
SELECT DISTINCT "feeds".* FROM "feeds" WHERE ("feeds"."user_id" IN ($1, $2, $3, $4, $5) OR "payments"."friend_id" IN ($6, $7, $8, $9, $10)) ORDER BY "feeds"."created_at" DESC LIMIT $11  [["user_id", 1], ["user_id", 2], ["user_id", 3], ["user_id", 4], ["user_id", 5], ["friend_id", 1], ["friend_id", 2], ["friend_id", 3], ["friend_id", 4], ["friend_id", 5], ["LIMIT", 11]]
---
      def feed_payments
        friends = friends_second_degree
        Feed.where(user_id: friends).or(Feed.where(friend_id: friends)).distinct
            .order(created_at: :desc).includes(:user, :friend)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def current_user
        @current_user ||= User.find(params[:id])